; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob99) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 - Pallet
	crate0 crate1 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 hoist13 hoist14 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear pallet5)
	(at truck0 depot1)
	(at truck1 depot2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor2)
	(available hoist6)
	(at hoist7 depot1)
	(available hoist7)
	(at hoist8 distributor0)
	(available hoist8)
	(at hoist9 depot0)
	(available hoist9)
	(at hoist10 distributor2)
	(available hoist10)
	(at hoist11 depot1)
	(available hoist11)
	(at hoist12 depot1)
	(available hoist12)
	(at hoist13 depot2)
	(available hoist13)
	(at hoist14 distributor1)
	(available hoist14)
	(at crate0 depot1)
	(on crate0 pallet1)
	(at crate1 depot1)
	(on crate1 crate0)
)

(:goal (and
		(on crate0 pallet0)
		(on crate1 pallet5)
	)
))

; plan
1. (lift hoist11 crate1 crate0 depot1)
   deleted: (at crate1 depot1) (clear crate1) (available hoist11) (on crate1 crate0)
   added: (lifting hoist11 crate1) (clear crate0)
   goals met: 0 of 2
2. (load hoist11 crate1 truck0 depot1)
   deleted: (lifting hoist11 crate1)
   added: (in crate1 truck0) (available hoist11)
   goals met: 0 of 2
3. (lift hoist7 crate0 pallet1 depot1)
   deleted: (at crate0 depot1) (clear crate0) (available hoist7) (on crate0 pallet1)
   added: (lifting hoist7 crate0) (clear pallet1)
   goals met: 0 of 2
4. (load hoist7 crate0 truck0 depot1)
   deleted: (lifting hoist7 crate0)
   added: (in crate0 truck0) (available hoist7)
   goals met: 0 of 2
5. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 0 of 2
6. (unload hoist9 crate0 truck0 depot0)
   deleted: (in crate0 truck0) (available hoist9)
   added: (lifting hoist9 crate0)
   goals met: 0 of 2
7. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 0 of 2
8. (unload hoist6 crate1 truck0 distributor2)
   deleted: (in crate1 truck0) (available hoist6)
   added: (lifting hoist6 crate1)
   goals met: 0 of 2
9. (drop hoist9 crate0 pallet0 depot0)
   deleted: (lifting hoist9 crate0) (clear pallet0)
   added: (available hoist9) (at crate0 depot0) (clear crate0) (on crate0 pallet0)
   goals met: 1 of 2
10. (drop hoist6 crate1 pallet5 distributor2)
   deleted: (lifting hoist6 crate1) (clear pallet5)
   added: (available hoist6) (at crate1 distributor2) (clear crate1) (on crate1 pallet5)
   goals met: 2 of 2
